Tekla Open API Reference for Tekla Structures 2025
ReinforcementCatalog Constructor (String, String, Double)
 Creates a new instance of the ReinforcementCatalog and will select in the tree the rebar that contains the given parameters (if possible).
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementCatalog(
	string Size,
	string Grade,
	double BendRadius
)
Public Sub New (
	Size As String,
	Grade As String,
	BendRadius As Double
)
Parameters
Size
Type: System.String
The size of the rebar to be selected.
Grade
Type: System.String
The grade of the rebar to be selected.
BendRadius
Type: System.Double
The bend radius of the rebar to be selected.
See Also
Reference
ReinforcementCatalog Class
ReinforcementCatalog Overload
Tekla.Structures.Dialog.UIControls Namespace